CREATE TABLE department
(
    department_id BIGSERIAL PRIMARY KEY,
    name VARCHAR(30)
);

INSERT INTO department(name)
VALUES
    ('marketing'),
    ('sales'),
    ('supply');

CREATE TABLE trip
(
    trip_id BIGSERIAL PRIMARY KEY,
    name VARCHAR(30),
    city VARCHAR(25),
    per_diem DECIMAL(8,2),
    date_first DATE,
    date_last DATE,
    department_id INT NOT NULL,
    FOREIGN KEY (department_id)  REFERENCES department (department_id)
);

INSERT INTO trip(name, city, per_diem, date_first, date_last, department_id)
VALUES
    ('Баранов П.Е.', 'Москва', '700', '2020-01-12', '2020-01-17', 1),
    ('Абрамова К.А.', 'Владивосток', '450', '2020-01-14', '2020-01-27', 2),
    ('Семенов И.В.', 'Москва', '700', '2020-01-23', '2020-01-31', 3),
    ('Ильиных Г.Р.', 'Владивосток', '450', '2020-01-12', '2020-02-02', 1),
    ('Колесов С.П.', 'Москва', '700', '2020-02-01', '2020-02-06', 2),
    ('Баранов П.Е.', 'Москва', '700', '2020-02-14', '2020-02-22', 1),
    ('Абрамова К.А.', 'Москва', '700', '2020-02-23', '2020-03-01', 2),
    ('Лебедев Т.К.', 'Москва', '700', '2020-03-03', '2020-03-06', 3),
    ('Колесов С.П.', 'Новосибирск', '450', '2020-02-27', '2020-03-12', 2),
    ('Семенов И.В.', 'Санкт-Петербург', '700', '2020-03-29', '2020-04-05', 3),
    ('Абрамова К.А.', 'Москва', '700', '2020-04-06', '2020-04-14', 2),
    ('Баранов П.Е.', 'Новосибирск', '450', '2020-04-18', '2020-05-04', 1),
    ('Лебедев Т.К.', 'Томск', '450', '2020-05-20', '2020-05-31', 3),
    ('Семенов И.В.', 'Санкт-Петербург', '700', '2020-06-01', '2020-06-03', 3),
    ('Абрамова К.А.', 'Санкт-Петербург', '700', '2020-05-28', '2020-06-04', 2),
    ('Федорова А.Ю.', 'Новосибирск', '450', '2020-05-25', '2020-06-04', 3),
    ('Колесов С.П.', 'Новосибирск', '450', '2020-06-03', '2020-06-12', 2),
    ('Федорова А.Ю.', 'Томск', '450', '2020-06-20', '2020-06-26', 3),
    ('Абрамова К.А.', 'Владивосток', '450', '2020-07-02', '2020-07-13', 2),
    ('Баранов П.Е.', 'Воронеж', '450', '2020-07-19', '2020-07-25', 1);
SELECT * FROM trip;